#+TITLE: January 21, 2019 - February 5, 2019 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------+------+-------------+---------+--------------------------------------------------------------+----------|
|      |      |             |         | OPS.1545721236. GNU Emacs bug triaging (2019-02-05)          |          |
|      |      |             |         | READ.1548140097. NIOS Maths Text Book - Part I (2019-02-05)  |          |
|      |      |             |         | READ.1548088815. [[https://www.coursera.org/lea (2019-02-05) |          |
|      |      |             |         | DEV.1548171355. Project Hacker News (2019-02-05)             |          |
|      |      |             |         | READ.1547130354. Chapter 11. Testing (2019-01-30)            |          |
|      |      |             |         | DEV.1547130395. Chapter 11 Exercises (2019-01-29)            |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED |            ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+-------------------+------+-----------+--------------+------------|
| Sandeepk      |        24 |             14.58 |   24 |         0 |   2019-03-01 | ########## |
| Jasonbraganza |         0 |                 0 |    0 |         0 |   2019-03-01 | ---------- |
| Bhavin192     |      7.85 | 5.640000000000001 | 7.85 |         0 |   2019-03-01 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:16]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                               |
|-----+------------+--------+-------+---------------------------------------------------------------|
|   1 | 2019-01-21 |  81.85 |    77 |                                                               |
|   2 | 2019-01-22 |  81.85 |    72 |                                                               |
|   3 | 2019-01-23 |  81.85 |    67 |                                                               |
|   4 | 2019-01-24 |  81.85 |    61 |                                                               |
|   5 | 2019-01-25 |  81.85 |    56 |                                                               |
|   6 | 2019-01-26 |  81.85 |    51 |                                                               |
|   7 | 2019-01-27 |  81.85 |    46 |                                                               |
|   8 | 2019-01-28 |  81.85 |    41 |                                                               |
|   9 | 2019-01-29 |   78.5 |    36 | DEV.1547130395                                                |
|  10 | 2019-01-30 |   76.0 |    31 | READ.1547130354                                               |
|  11 | 2019-01-31 |   76.0 |    26 |                                                               |
|  12 | 2019-02-01 |   76.0 |    20 |                                                               |
|  13 | 2019-02-02 |   76.0 |    15 |                                                               |
|  14 | 2019-02-03 |   76.0 |    10 |                                                               |
|  15 | 2019-02-04 |   76.0 |     5 |                                                               |
|  16 | 2019-02-05 |    0.0 |     0 | DEV.1548171355 READ.1548088815 READ.1548140097 OPS.1545721236 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                           | TASKID          | OWNER     | PRIORITY | TODO | ESTIMATED |            ACTUAL |
|--------------------------------+-----------------+-----------+----------+------+-----------+-------------------|
| TASKS                          |                 |           | B        |      |     81.85 |             35.22 |
|--------------------------------+-----------------+-----------+----------+------+-----------+-------------------|
| bhavin192                      |                 |           | B        |      |      7.85 | 5.640000000000001 |
| Learning Golang                |                 |           | B        |      |      5.85 |              3.22 |
| Chapter 11. Testing            | READ.1547130354 | bhavin192 | B        | DONE |       2.5 |              1.37 |
| Chapter 11 Exercises           | DEV.1547130395  | bhavin192 | B        | DONE |      3.35 |              1.85 |
| GNU Emacs bug triaging         | OPS.1545721236  | bhavin192 | B        | DONE |         2 |              2.42 |
|--------------------------------+-----------------+-----------+----------+------+-----------+-------------------|
| jasonbraganza                  |                 |           | B        |      |      50.0 |              15.0 |
| NIOS Maths Text Book - Part I  | READ.1548140097 | shaks     | B        | DONE |      50.0 |             15.00 |
|--------------------------------+-----------------+-----------+----------+------+-----------+-------------------|
| sandeepk                       |                 |           | B        |      |        24 |             14.58 |
| [[https://www.coursera.org/learn/learning-how-to-learn/][Learning How to Learn]] - Part I | READ.1548088815 | sandeepk  | B        | DONE |         9 |              4.58 |
| Project Hacker News            | DEV.1548171355  | sandeepk  | B        | DONE |        15 |             10.00 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2019-01-21 Mon>
  :wpd-bhavin192: 0.5
  :wpd-jasonbraganza: 5
  :wpd-sandeepk: 1.5
  :END:
** bhavin192
*** Learning Golang
**** DONE Chapter 11. Testing [6/6]
     CLOSED: [2019-01-30 Wed 22:43]
     :PROPERTIES:
     :ESTIMATED: 2.5
     :ACTUAL:   1.37
     :OWNER:    bhavin192
     :ID:       READ.1547130354
     :TASKID:   READ.1547130354
     :END:
     :LOGBOOK:
     CLOCK: [2019-01-30 Wed 22:38]--[2019-01-30 Wed 22:43] =>  0:05
     CLOCK: [2019-01-30 Wed 22:23]--[2019-01-30 Wed 22:37] =>  0:14
     CLOCK: [2019-01-28 Mon 19:36]--[2019-01-28 Mon 19:48] =>  0:12
     CLOCK: [2019-01-28 Mon 19:23]--[2019-01-28 Mon 19:35] =>  0:12
     CLOCK: [2019-01-26 Sat 19:49]--[2019-01-26 Sat 19:53] =>  0:04
     CLOCK: [2019-01-26 Sat 19:18]--[2019-01-26 Sat 19:32] =>  0:14
     CLOCK: [2019-01-26 Sat 17:43]--[2019-01-26 Sat 17:59] =>  0:16
     CLOCK: [2019-01-24 Thu 22:35]--[2019-01-24 Thu 22:40] =>  0:05
     :END:
     - [X] 11.1 The go test Tool    (10m)
     - [X] 11.2 Test Functions      (1.7h)
     - [X] 11.3 Coverage            (20m)
     - [X] 11.4 Benchmark Functions (20m)
     - [X] 11.5 Profiling           (25m)
     - [X] 11.6 Example Functions   (5m)
**** DONE Chapter 11 Exercises [2/2]
     CLOSED: [2019-01-29 Tue 22:39]
     :PROPERTIES:
     :ESTIMATED: 3.35
     :ACTUAL:   1.85
     :OWNER:    bhavin192
     :ID:       DEV.1547130395
     :TASKID:   DEV.1547130395
     :END:
     :LOGBOOK:
     CLOCK: [2019-01-29 Tue 22:10]--[2019-01-29 Tue 22:39] =>  0:29
     CLOCK: [2019-01-26 Sat 19:41]--[2019-01-26 Sat 19:47] =>  0:06
     CLOCK: [2019-01-26 Sat 17:37]--[2019-01-26 Sat 17:43] =>  0:06
     CLOCK: [2019-01-22 Tue 20:18]--[2019-01-22 Tue 20:39] =>  0:21
     CLOCK: [2019-01-21 Mon 20:51]--[2019-01-21 Mon 21:23] =>  0:32
     CLOCK: [2019-01-21 Mon 20:08]--[2019-01-21 Mon 20:25] =>  0:17
     :END:
     - [X] 11.2 (3h)
     - [X] 11.4 (1.25h)
*** DONE GNU Emacs bug triaging [2/2]
    CLOSED: [2019-02-05 Tue 23:59]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   2.42
    :OWNER:    bhavin192
    :ID:       OPS.1545721236
    :TASKID:   OPS.1545721236
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-05 Tue 23:25]--[2019-02-05 Tue 23:59] =>  0:34
    CLOCK: [2019-02-04 Mon 19:35]--[2019-02-04 Mon 19:55] =>  0:20
    CLOCK: [2019-02-02 Sat 11:09]--[2019-02-02 Sat 11:48] =>  0:39
    CLOCK: [2019-01-31 Thu 21:20]--[2019-01-31 Thu 21:39] =>  0:19
    CLOCK: [2019-01-30 Wed 17:12]--[2019-01-30 Wed 17:45] =>  0:33
    :END:
    - [X] Build GNU Emacs 26.1 from source code
    - [X] Triage 5 bugs
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33983][#33983]]: c++-mode syntax highlighting after some symbols
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33979][#33979]]: python.el is not fully PEP 8 compliant for closing parens
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33973][#33973]]: Multi-line C++ raw string literal font lock is broken
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33921][#33921]]: Default height is inconsistently - and apparently
        also incorrectly - documented
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33900][#33900]]: GNUmakefile mode colors fooled by colons in shell commands
** jasonbraganza
*** DONE NIOS Maths Text Book - Part I [1/1]
    CLOSED: [2019-02-05 Tue 23:00]
    :PROPERTIES:
    :ESTIMATED: 50.0
    :ACTUAL:   15.00
    :OWNER: shaks
    :ID: READ.1548140097
    :TASKID: READ.1548140097
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-23 Wed 08:00]--[2019-01-23 Wed 13:00] =>  5:00
    CLOCK: [2019-01-22 Tue 08:00]--[2019-01-22 Tue 13:00] =>  5:00
    CLOCK: [2019-01-21 Mon 08:00]--[2019-01-21 Mon 13:00] =>  5:00
    :END:
    - [X] Module - I [3/3]
      - [X] 2019-01-19 - 1 - Sets
      - [X] 2019-01-20 - 2 - Relations and Functions
      - [X] 2019-01-21 - 3 - Trigonometric Functions I
** sandeepk
*** DONE [[https://www.coursera.org/learn/learning-how-to-learn/][Learning How to Learn]] - Part I [1/2]
    CLOSED: [2019-02-05 Tue 23:30]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   4.58
    :OWNER:    sandeepk
    :ID:       READ.1548088815
    :TASKID:   READ.1548088815
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-31 Thu 20:15]--[2019-01-31 Thu 21:35] =>  1:20
    CLOCK: [2019-01-29 Tue 20:55]--[2019-01-29 Tue 22:00] =>  1:05
    CLOCK: [2019-01-28 Mon 21:20]--[2019-01-28 Mon 22:25] =>  1:05
    CLOCK: [2019-01-26 Sat 13:55]--[2019-01-26 Sat 14:30] =>  0:35
    CLOCK: [2019-01-26 Sat 13:00]--[2019-01-26 Sat 13:30] =>  0:30
    :END:
    - [X] Procrastination and Memory (5h)
*** DONE Project Hacker News [3/3]
    CLOSED: [2019-02-05 Tue 23:30]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:   10.00
    :OWNER:    sandeepk
    :ID:       DEV.1548171355
    :TASKID:   DEV.1548171355
    :END:
    - [ ] Features Break Down (3h)
    - [ ] Env SetUp (6h)
    - [ ] Model Layout (6h)
